[
    {
        "time_stamp": "0-60s",
        "text": " Change the engine oil in your vehicle is one of the most important and necessary procedures to keep your vehicle running and on the road. Whether you have a car, a truck, a van, or an SUV, basic principles are the same and we're going to show you how to do it yourself. Why would you want to do it yourself? You're not going to save a ton of money, but doing it yourself, you're going to have peace of mind knowing the job was done right. Excuse me sir. The question is almost done, but we did notice a few other things. The steering wheel does get hard to turn at times and it makes noise. So we could flush it for you. And extra of the afternoon, we have an hour to wait. We're all going to spot this one. Six or four times. We'll flush it. We'll definitely help it. Yeah, and that's another reason. Items you're going to need are oil and oil filter. Based on your vehicle, you may need an oil filter socket, cup or strap wrench to get the drain plug off. You're going to need a wrench or a socket and ratchet. You're going to need a drain pin and a funnel. Also gloves."
    },
    {
        "time_stamp": "60-120s",
        "text": " and rags and if you can't get under your vehicle, a Jack and Jack stands. If you need any of these tools, check out 1AAuto.com. We're gonna wanna look at our engine in determined which side of the engine bay, the engine is on, especially if you have a front wheel drive vehicle. The engine is more on the passenger side. On this vehicle, the transmission is on the driver's side. So when we're underneath the vehicle, we're gonna make sure we drain the oil from the passenger side. Don't drain the transmission by accident. It happens all the time. We're gonna look for the fill cap. Fill cap is right there, and it says, we're kinda oil to use 5W30 for this vehicle. So we're gonna untwist the fill cap, pull it up. Give a truck a rigy for something that you can get underneath. You don't have to jack it up. But if you have a vehicle that's really low, something like this, you're gonna have to raise it up. When raising the vehicle, you wanna make sure you use the proper jacking locations on the vehicle, and you wanna..."
    },
    {
        "time_stamp": "120-180s",
        "text": " want to be on a solid level surface and you don't want to be in the dirt. Make sure you remove the drain plug counterclockwise. You do not want to tighten it by accident and damage the pants. Now we can let the oil drain out completely. So you're going to want to look at your drain plug. Make sure the threads look pretty good and this one looks okay. And also keep in mind the gasket. If the gasket looks like it's torn or crushed at all, you're going to want to replace it. You have a metal gasket and it's a good idea to replace the metal ones every time. But with the rubber ones as long as it looks okay, you can just reuse it. You're going to reinstall the drain plug. Take our wrench. And once the drain plug snug, we're just going to snug it up a little bit more. And that's good. You don't want to overtighten it or you could damage the oil pants. Now we're going to locate your oil filter. Some filters are underneath the car. You're the front of the engine. Some of them are in the rear of the engine. And some of them are on the side near the wheel."
    },
    {
        "time_stamp": "180-240s",
        "text": " well. And this car the filter is right on top. There's two types of filters. You have the canister or twist on type filter or you have the cartridge filter. With the canister type filter, you're going to want to make sure you lubricate the seal on the outside with oil. Otherwise it's going to be very difficult to remove the next time you remove it. And when you're installing these types of filters, once it's snug, you give it another quarter turn and that's it. This is where you're going to use your oil filter removal tools. You're going to either use the oil filter socket tool for the cartridge style. Sometimes you'll need a cup for the cartridge style. Also for the canister style if you have the correct cup. That will work for that as well or a strap wrench. Now that you've drained the oil and changed the filter, it's time to add the oil. You can use conventional or synthetic motor oil, eye per person, synthetic oil. Some vehicles require it. Check your owner's manual for the amount and the type."
    },
    {
        "time_stamp": "240-292s",
        "text": " Don't forget to put your cap back on, that would be bad. Now we're going to start the car for about 10 to 15 seconds and get the oil where it needs to go. After shutting the engine off, let it sit for about two or three minutes and then we're going to check the dipstick. We're going to wipe off the dipstick first, reinsert the dipstick, and then pull it out, and we'll check the level. So you want to make sure the oil level is in between these hash marks. If you just changed it, then you want it up closer to the top of it, which it is. So we're actually perfect right there. We don't have the admi. If the oil level is a little low, you can add some more and then recheck it. That's it. Your oil change is done. I hope you enjoyed this video and it gave you the confidence to do it yourself. And as always, if you need any parts for your vehicle, check out 1aauto.com."
    }
]